* Background

#+begin_src bibtex
@inproceedings{Daoud2014SevenML,
  title={Seven More Languages in Seven Weeks: Languages That Are Shaping the Future},
  author={F. Daoud and Ian Dees and Bruce A. Tate and J. Moffitt},
  year={2014}
}
#+end_src

#+begin_example
elixir 1.11.1
elm 0.19.1
erlang 23.1.1
idris current
julia 1.5.1
lua 5.3.5
nodejs 12.18.1
python 3.7.8
ruby 2.7.2
#+end_example

* [#C] Lua 5.3.5                                                        :tcl:

- https://www.lua.org/
- https://repl.it/languages/lua
- http://lua-users.org/wiki/MetaLuaAbstractSyntaxTree

#+begin_src sh
brew install lua cmake rtmidi luarocks
luarocks install luarepl
#+end_src

#+begin_src sh
lua -e 'print(_VERSION)'
#+end_src

#+RESULTS:
: Lua 5.3

#+begin_src elisp
  (package-install 'lua-mode)
  (package-install 'luarocks)
#+end_src

** DONE Day 1: The Call to Adventure

** DONE Day 2: Tables All the Way Down

** TODO Day 3: Lua and the World

* [#C] Factor 0.98                                              :forth:jvm:c:

- https://factorcode.org/
- https://docs.factorcode.org/content/article-first-program-test.html

#+begin_src
brew cask install factor
#+end_src

#+begin_src sh
/Applications/factor/factor --version
#+end_src

#+RESULTS:
| Factor | 0.98       | x86.64 | (1889,     | heads/master-7999e72aec, | Jul  |    30 |               2018 | 12:10:02) |        |
| [Clang | (GCC       |  4.2.1 | Compatible | Apple                    | LLVM | 7.3.0 | (clang-703.0.29))] |        on | macosx |
| IN:    | scratchpad |        |            |                          |      |       |                    |           |        |

- https://factorcode.org/

#+begin_src elisp
(server-start)
#+end_src

#+begin_src factor
USE: editor.emacs
\ at edit
#+end_src

** TODO Day 1: Stack On, Stack Off

** TODO Day 2: Painting the Fence

** TODO Day 3: Balancing on a Boat

* [#A] Elm 0.19.1                                             :haskell:ocaml:

- https://elm-lang.org/
- https://guide.elm-lang.org/install/elm.html
- http://media.pragprog.com/titles/7lang/elm.pdf
- https://github.com/avh4/elm-format

#+begin_src sh
brew install elm
#+end_src

#+begin_src sh
elm  --version
#+end_src

#+RESULTS:
: 0.19.1

#+begin_src elisp
  (package-install 'elm-mode)
#+end_src

** TODO Day 1: Handling the Basics

** TODO Day 2: Taming Callbacks excerpt

** TODO Day 3: It’s All a Game

* [#A] Elixir 1.10.4                               :erlang:ruby:lisp:clojure:

- https://elixir-lang.org/
- https://repl.it/languages/elixir
- https://elm-lang.org/try
- https://www.botsquad.com/2019/04/11/the-ast-explained/

#+begin_src sh
 brew install elixir
#+end_src

#+begin_src sh
elixir -v
#+end_src

#+RESULTS:
| Erlang/OTP |     23 | [erts-11.0.4] | [source] | [64-bit]   | [smp:16:16] | [ds:16:16:10] | [async-threads:1] | [hipe] | [dtrace] |
| Elixir     | 1.10.4 | (compiled     | with     | Erlang/OTP |         23) |               |                   |        |          |

#+begin_src elisp
  (package-install 'elixir-mode)
#+end_src

** TODO Day 1: Laying a Great Foundation

** TODO Day 2: Controlling Mutations

** TODO Day 3: Spawning and Respawning

* [#B] Julia 1.5.1                                                 :r:python:

- https://julialang.org/
- https://repl.it/languages/julia
- https://docs.julialang.org/en/v1/devdocs/ast/

#+begin_src sh
brew cask install julia
#+end_src


#+begin_src sh
/usr/local/bin/julia --version
#+end_src

#+RESULTS:
: julia version 1.5.1

** TODO Day 1: Resistance is Futile

** TODO Day 2: Getting Assimilated

** TODO Day 3: Become One with Julia

* [#A] core.logic 1.0.0                           :prolog:scheme:clojure:jvm:

- https://repl.it/languages/scheme
- http://io.livecode.ch/learn/webyrd/webmk
- https://github.com/pythological/kanren

#+begin_src sh
brew install guile
#+end_src

#+begin_src elisp
  (package-install 'paredit)
  (package-install 'geiser)

#+end_src

** TODO Day 1: Unified Theories of Code

** TODO Day 2: Mixing the Logical and Functional

** TODO Day 3: Writing Stories with Logic

* [#A] Idris 1.3.3                                                  :haskell:

- https://www.idris-lang.org/
- http://docs.idris-lang.org/en/latest/tutorial/interp.html

#+begin_src sh
brew install coreutils chezscheme
#+end_src

- https://github.com/idris-lang/Idris2
- https://github.com/idris-lang/Idris2/blob/master/INSTALL.md

#+begin_src sh
git clone https://github.com/idris-lang/Idris2.git && cd Idris2/
make bootstrap SCHEME=chez
make install
#+end_src

#+begin_src sh
~/.idris2/bin/idris2 --version
#+end_src

#+RESULTS:
| Idris 2 | version 0.2.1-3f105cdc0 |

** TODO Day 1: The Basics

** TODO Day 2: Getting Started with Dependent Types

** TODO Day 3: Dependent Types in Action
